app/views/authors/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 1]]
---
<ul>
	<% @author.books.each do |book| %>