app/views/books/edit.html.erb


  <p>Author: <%= form.select :author_id, Author.all.map { |author| [ author.to_s, author.id ] } %></p>
---
SELECT "authors".* FROM "authors"