app/views/books/new.html.erb

SELECT "authors".* FROM "authors"
---

  <p>Author: <%= form.select :author_id, Author.all.map { |author| [ author.to_s, author.id ] } %></p>