app/controllers/authors_controller.rb

  def create
  	@author = Author.create(author_params)
---
INSERT INTO "authors" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Ravi"], ["last_name", "Kishan"], ["created_at", "2022-03-13 17:34:21.791569"], ["updated_at", "2022-03-13 17:34:21.791569"]]

  def destroy
  	@author.books.each do |book|
  		book.destroy
  	end
  	@author.destroy
---
SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 2]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 1]]