app/controllers/books_controller.rb

  def create
  	@book = Book.create(book_params)
---
INSERT INTO "books" ("title", "isbn", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "tes"], ["isbn", "ana"], ["description", "anan"], ["author_id", 1], ["created_at", "2022-03-13 17:36:28.750012"], ["updated_at", "2022-03-13 17:36:28.750012"]]

  def update
  	@book.update(book_params)
---
UPDATE "books" SET "title" = ?, "isbn" = ?, "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "firstBook"], ["isbn", "1222"], ["description", "Test description"], ["updated_at", "2022-03-14 09:57:05.079788"], ["id", 9]]